початок = int(input("Введіть початок діапазону: "))
кінець = int(input("Введіть кінець діапазону: "))
print("Числа у заданому діапазоні та їх статус (кратне 7, кратне 5, або кратне і 7 і 5):")

for число in range(початок, кінець + 1):
    кратне_7 = (число % 7 == 0)
    кратне_5 = (число % 5 == 0)

    if кратне_7 and кратне_5:
        статус = "кратне 7 і 5"
    elif кратне_7:
        статус = "кратне 7"
    elif кратне_5:
        статус = "кратне 5"
    else:
        статус = "не кратне ні 7, ні 5"

    print(f"{число}: {статус}")
